"""
2. 	Представлен список чисел. Необходимо вывести элементы
    исходного списка, значения которых больше предыдущего элемента.
    Подсказка: элементы, удовлетворяющие условию, оформить
    в виде списка. Для формирования списка использовать генератор.
    Пример исходного списка: [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55].
    Результат: [12, 44, 4, 10, 78, 123].
"""
from random import randint
RAND_MIN = 0
RAND_MAX = 1000
COUNT = 100

INITIAL_LIST = [randint(RAND_MIN, RAND_MAX) for _ in range(COUNT)]
# INITIAL_LIST = [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55]

RESULT = [ELEM for INX, ELEM in enumerate(INITIAL_LIST)
          if INX != 0 and ELEM > INITIAL_LIST[INX - 1]]

print(f"Первоночальный список: {INITIAL_LIST}\nРезультат - {RESULT}")

"""
Первоночальный список: [824, 134, 896, 721, 129, 362, 354, 231, 794, 224, 816, 321, 415, 784, 483, 153, 187, 766, 451, 514, 332, 521, 748, 805, 68, 652, 558, 742, 517, 29, 28, 739, 681, 613, 809, 750, 961, 900, 510, 902, 980, 976, 712, 580, 78, 287, 812, 94, 159, 798, 739, 903, 509, 951, 251, 573, 939, 165, 949, 935, 614, 646, 404, 358, 17, 677, 719, 383, 456, 12, 545, 856, 690, 106, 427, 475, 91, 776, 219, 338, 775, 129, 531, 196, 982, 751, 566, 106, 298, 94, 314, 331, 833, 178, 393, 304, 130, 110, 116, 271]
Результат - [896, 362, 794, 816, 415, 784, 187, 766, 514, 521, 748, 805, 652, 742, 739, 809, 961, 902, 980, 287, 812, 159, 798, 903, 951, 573, 939, 949, 646, 677, 719, 456, 545, 856, 427, 475, 776, 338, 775, 531, 982, 298, 314, 331, 833, 393, 116, 271]
"""
